In [2]:
import pandas as pd

data = {
    'age': [25, 30, 35, 40],
    'salary': [50000, 60000, 70000, 80000],
    'gender': ['F', 'M', 'F', 'M']
}

df = pd.DataFrame(data)
df.head(2) # this is very similar to select * from table limit 2
df.tail(2) # this is very similar to select * from table limit -2

   age  salary gender
2   35   70000      F
3   40   80000      M

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.shape
df.columns 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int64
 1   salary  4 non-null      int64
 2   gender  4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [5]:
df.describe(include='all')

              age        salary gender
count    4.000000      4.000000      4
unique        NaN           NaN      2
top           NaN           NaN      F
freq          NaN           NaN      2
mean    32.500000  65000.000000    NaN
std      6.454972  12909.944487    NaN
min     25.000000  50000.000000    NaN
25%     28.750000  57500.000000    NaN
50%     32.500000  65000.000000    NaN
75%     36.250000  72500.000000    NaN
max     40.000000  80000.000000    NaN

In [6]:
df.head()

# select age from table
type(df['age'])

pandas.core.series.Series

In [7]:
# select age, salary from table
df[['age', 'salary']]

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [8]:
df

   age  salary gender
0   25   50000      F
1   30   60000      M
2   35   70000      F
3   40   80000      M

In [9]:
# select age, salary from table where age<35 : filtering
cond_1 =(df.age < 35)
cond_2 = (df.gender=='F')

df[cond_1 & cond_2]

   age  salary gender
0   25   50000      F

In [10]:
report_df = df.groupby('gender').agg({'salary':['mean','sum'],
                          'age':'mean'})

# this is very similar to sql group by
# select avg(salary), sum(salary), avg(age) from table group by gender

# sometime you also do order by
df.groupby('gender').agg({'salary':['mean','sum'],
                          'age':'mean'}).sort_values(by=('salary', 'mean'), ascending=False)

         salary           age
           mean     sum  mean
gender
M       70000.0  140000  35.0
F       60000.0  120000  30.0

In [11]:
type(report_df)

pandas.core.frame.DataFrame

In [12]:
data = {
    'product_id': [1, 2, 3, 4, 5],
    'product_name': ['A', 'B', 'C', 'D', 'E'],
    'category': ['X', 'Y', 'X', 'Y', 'X'],
    'brand': ['P', 'P', 'P', 'Q', 'P'],
    'price': [100, 200, 150, 300, 250],
    'quantity': [10, 20, 15, 30, 25]
}

retail_df = pd.DataFrame(data)

In [13]:
retail_df.head()

   product_id product_name category brand  price  quantity
0           1            A        X     P    100        10
1           2            B        Y     P    200        20
2           3            C        X     P    150        15
3           4            D        Y     Q    300        30
4           5            E        X     P    250        25

In [14]:
final_result =retail_df.groupby(['category', 'brand']).agg({'price':'mean', 'quantity':'sum'})

In [15]:
final_result.to_csv('/Users/rahultiwari/Documents/Harika_AI/data/final_report.csv')

In [16]:
data = pd.read_csv('/Users/rahultiwari/Documents/Harika_AI/data/final_report.csv')

In [17]:
data

  category brand       price  quantity
0        X     P  166.666667        50
1        Y     P  200.000000        20
2        Y     Q  300.000000        30

In [18]:
# assignment
import numpy as np
# lets create the datafor retail domain with discount and other variable
data= {
    'product_id': np.random.randint(1000, 9999, 5000),
    'product_name': np.random.choice(['A', 'B', 'C', 'D', 'E'], 5000),
    'category': np.random.choice(['Electronics', 'Clothing', 'Groceries'], 5000),
    'brand': np.random.choice(['P', 'Q', 'R'], 5000),
    'price': np.random.uniform(10, 100, 5000),
    'quantity': np.random.randint(1, 20, 5000),
    'discount': np.random.uniform(0, 0.3, 5000)
}

df = pd.DataFrame(data)
df.head()

# Questions

# 1. What is the average price of products in each category?
# 2. Which brand has the highest average discount?
# 3. What is the total revenue generated from each product?
# 4. How many products are there in each category?
# 5. What is the most popular product (highest quantity sold)?

   product_id product_name     category brand      price  quantity  discount
0        8119            B  Electronics     R  73.111499         2  0.203070
1        1095            B    Groceries     R  97.179348        14  0.290048
2        1960            E  Electronics     Q  90.561340         5  0.085321
3        9564            E  Electronics     P  98.792371        17  0.063700
4        8998            E    Groceries     P  28.342487        17  0.020569

In [ ]:
# https://pandas.pydata.org/docs/getting_started/index.html#getting-started

In [17]:
# group by 
# join -left join, right join 
import pandas as pd
product = pd.DataFrame({
    'product_id_x': [1, 2, 3],
    'product_name': ['A', 'B', 'C'],
    'price': [100, 200, 300]
})

customer = pd.DataFrame({
    # 'customer_id': [1, 1, 1, 2, 2, 2],
    'customer_name': ['john', 'john', 'john', 'Alice', 'Alice', 'Alice'],
    'product_id_y': [1, 2, 3, 1, 2, 4]
})

left_merged_df = customer.merge(product, left_on='product_id_y', right_on='product_id_x', how='left')
left_merged_df

  customer_name  product_id_y  product_id_x product_name  price
0          john             1           1.0            A  100.0
1          john             2           2.0            B  200.0
2          john             3           3.0            C  300.0
3         Alice             1           1.0            A  100.0
4         Alice             2           2.0            B  200.0
5         Alice             4           NaN          NaN    NaN

In [ ]:
# join method

df_1= pd.DataFrame({
    'key': ['A', 'B', 'C'],
    'value_1': [1, 2, 3]
})

df_2 = pd.DataFrame({
    'key': ['B', 'C', 'D'],
    'value_2': [4, 5, 6]
})

df_1.join(df_2.set_index('key'), on='key')

  key  value_1  value_2
0   A        1      NaN
1   B        2      4.0
2   C        3      5.0

In [ ]:
# joining two dataframe horizontally : appending df on columns
df_1 = pd.DataFrame({
    'c1': [1, 2, 3],
    'c2': ['A', 'B', 'C'],
    'c3': [True, False, True]

})

df_2 = pd.DataFrame({
    'c1': [4, 5, 6],
    'c2': ['D', 'E', 'F'],
    'c3': [False, True, False]
})

df_combined = pd.concat([df_1, df_2], axis=1) # here axis=1 means we are concatenating along the columns
df_combined

# this is very similar to inserting columns in a SQL table

   c1 c2     c3  c1 c2     c3
0   1  A   True   4  D  False
1   2  B  False   5  E   True
2   3  C   True   6  F  False

In [49]:
import numpy as np
sales_data = {
  'cust_id': np.random.randint(1000, 9999, 5000),
  'age': np.random.randint(18, 70, 5000),
  'gender': np.random.choice(['M', 'F'], 5000),
  'location': np.random.choice(['New York', 'Los Angeles', 'Chicago'], 5000),
  'product': np.random.choice(['Laptop', 'Smartphone', 'Tablet'], 5000),
  'quantity': np.random.randint(1, 3, 5000)
}
sales_df = pd.DataFrame(sales_data)

# price_data
price_data = {
  'product': np.random.choice(['Laptop', 'Smartphone', 'Tablet'], 5000),
  'price': np.random.uniform(100, 1500, 5000)
}
price_df = pd.DataFrame(price_data)

# Questions which need to solve?

# 1. What is the average price of products sold to different age groups?
# 2. How does the gender distribution look across different product categories?
# 3. What is the most popular product in each location?
# 4. Are there any correlations between age and the price of products purchased? # ignore for now - we will discuss in our maths
# 5. How does the sales distribution look across different locations?
# 6. What is the average quantity of products sold per transaction?
# 7. What is the total revenue generated from each product category?
# 8. What is the average price of products sold to different age groups?

In [37]:
def age_group(x):
    if x < 25:
        return '18-24'
    elif 25 <= x < 35:
        return '25-34'
    elif 35 <= x < 45:
        return '35-44'
    elif 45 <= x < 55:
        return '45-54'
    else:
        return '55+'

In [38]:
final_table = sales_df.merge(price_df, on='product')
final_table['age_group'] = final_table['age'].apply(age_group) # here apply method will take function as input and apply that function to each row/column
final_table.head()

   cust_id  age gender location     product  quantity        price age_group
0     3859   62      M  Chicago  Smartphone         2   186.126856       55+
1     3859   62      M  Chicago  Smartphone         2  1396.189297       55+
2     3859   62      M  Chicago  Smartphone         2  1081.244683       55+
3     3859   62      M  Chicago  Smartphone         2   224.631967       55+
4     3859   62      M  Chicago  Smartphone         2   661.077465       55+

In [39]:
final_table['total_price'] = final_table['price'] * final_table['quantity']
final_table.head()

,cust_id,age,gender,location,product,quantity,price,age_group,total_price
0,3859,62,M,Chicago,Smartphone,2,186.126856,55+,372.253713
1,3859,62,M,Chicago,Smartphone,2,1396.189297,55+,2792.378593
2,3859,62,M,Chicago,Smartphone,2,1081.244683,55+,2162.489366
3,3859,62,M,Chicago,Smartphone,2,224.631967,55+,449.263933
4,3859,62,M,Chicago,Smartphone,2,661.077465,55+,1322.154930

In [48]:
# 2. How does the gender distribution look across different product categories?
# lets do it from scratch
gender_distribution = final_table.groupby(['product', 'gender']).agg({'quantity': 'sum'})
# in terms of % age
def gender_percentage(x):
    return 100 * x / float(x.sum())

gender_distribution = gender_distribution.groupby(level=0).apply(gender_percentage)
gender_distribution

/var/folders/fq/kr6gv5l17pd4j572n0_n3f2c0000gn/T/ipykernel_16561/2133005944.py:6: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  return 100 * x / float(x.sum())

                               quantity
product    product    gender
Laptop     Laptop     F       52.503975
                      M       47.496025
Smartphone Smartphone F       47.733544
                      M       52.266456
Tablet     Tablet     F       51.719951
                      M       48.280049

In [47]:
gender_distribution.groupby(level=0).groups

{'Laptop': ['Laptop'], 'Smartphone': ['Smartphone'], 'Tablet': ['Tablet']}